In [13]:
person={
    "first":["ari","sam","thiruttu"],
    "last":["prabhu","robin","maddy"],
    "email":["ari002@gmail.com","sam003@gamil.com","maddy@gmail.com"]
}
people={
    "first":["mari","ram","thiruttu"],
    "last":["muthu","kumar","kutti"],
    "email":["muthumariappan002@gmail.com","ram003@gamil.com","thiruttu@gmail.com"]
}
import pandas as pd
df=pd.DataFrame(people)
df

      first   last                        email
0      mari  muthu  muthumariappan002@gmail.com
1       ram  kumar             ram003@gamil.com
2  thiruttu  kutti           thiruttu@gmail.com

In [14]:
import pandas as pd
#multiindex:
df2 = pd.DataFrame(
    {
        'a': [4, 7, 9],
        'b': [3, 5, 8],
        'c': [10, 11, 12]
    },
    index=pd.MultiIndex.from_tuples([('d', 1), ('d', 2), ('e', 2)], names=['n', 'v'])
)
df2

     a  b   c
n v
d 1  4  3  10
  2  7  5  11
e 2  9  8  12

In [15]:
#reshaping data:
#column to rows
pd.melt(df)

  variable                        value
0    first                         mari
1    first                          ram
2    first                     thiruttu
3     last                        muthu
4     last                        kumar
5     last                        kutti
6    email  muthumariappan002@gmail.com
7    email             ram003@gamil.com
8    email           thiruttu@gmail.com

In [16]:
df.columns
df

      first   last                        email
0      mari  muthu  muthumariappan002@gmail.com
1       ram  kumar             ram003@gamil.com
2  thiruttu  kutti           thiruttu@gmail.com

In [17]:
df.sort_values(by='first')

      first   last                        email
0      mari  muthu  muthumariappan002@gmail.com
1       ram  kumar             ram003@gamil.com
2  thiruttu  kutti           thiruttu@gmail.com

In [18]:
import pandas as pd
df3=pd.DataFrame(person)
df3

      first    last             email
0       ari  prabhu  ari002@gmail.com
1       sam   robin  sam003@gamil.com
2  thiruttu   maddy   maddy@gmail.com

In [21]:
pd.concat([df,df3])

      first    last                        email
0      mari   muthu  muthumariappan002@gmail.com
1       ram   kumar             ram003@gamil.com
2  thiruttu   kutti           thiruttu@gmail.com
0       ari  prabhu             ari002@gmail.com
1       sam   robin             sam003@gamil.com
2  thiruttu   maddy              maddy@gmail.com

In [24]:
pd.concat([df,df3],axis=1)

,first,last,email,first,last,email
0,mari,muthu,muthumariappan002@gmail.com,ari,prabhu,ari002@gmail.com
1,ram,kumar,ram003@gamil.com,sam,robin,sam003@gamil.com
2,thiruttu,kutti,thiruttu@gmail.com,thiruttu,maddy,maddy@gmail.com

# SUBSET OBERVATIONS IN ROWS:
1.df[df.length>7]

2.df.drop_duplicates()

3.df.sample(frac=0.5)

4.df.sample(n=10)

5.df.nlargest(n,'value')

6.df.nsmallest(n,'value')

7.df.head(n)

8.df.tail(n)

In [45]:

df.drop_duplicates()

      first   last                        email
0      mari  muthu  muthumariappan002@gmail.com
1       ram  kumar             ram003@gamil.com
2  thiruttu  kutti           thiruttu@gmail.com

In [44]:
#sample:randomly selected sample of rows:
df.sample(frac=0.5)

      first   last               email
1       ram  kumar    ram003@gamil.com
2  thiruttu  kutti  thiruttu@gmail.com

In [50]:
df.sample(n=2)

      first   last               email
2  thiruttu  kutti  thiruttu@gmail.com
1       ram  kumar    ram003@gamil.com

# SUBSET VARIABLE IN COLUMNS:

1.df[[columns names]]

2.df.filter(like='column_name')

In [55]:
df.filter(like='email')

                         email
0  muthumariappan002@gmail.com
1             ram003@gamil.com
2           thiruttu@gmail.com

# SUBSSETS - ROWS AND COLUMNS:

1.Use df.loc[] and df.iloc[] to select only 
rows, only columns or both.

2.Use df.at[] and df.iat[] to access a single 
value by row and column.

In [57]:
df.iat[0,1]

'muthu'

In [58]:
df.at[0,'first']

'mari'

# USING QUERIES:

1.query() allows Boolean expressions for filtering 
rows.


df.query('columnname > 7')\

df.query('columnname > 7 and columnname2 < 8')

df.query('Name.str.startswith("abc")', 
engine="python")

In [75]:
df.query('first.str.startswith("mari")', 
engine="python")

  first   last                        email
0  mari  muthu  muthumariappan002@gmail.com

In [79]:
df.any()

first    True
last     True
email    True
dtype: bool

In [80]:
df.all()

first    True
last     True
email    True
dtype: bool

In [82]:
pd.isnull(df)

   first   last  email
0  False  False  False
1  False  False  False
2  False  False  False

In [83]:
pd.notnull(df)

   first  last  email
0   True  True   True
1   True  True   True
2   True  True   True

# SUMMARIZE DATA:

df['w'].value_counts()
Count number of rows with each unique value of variable

len(df)
of rows in DataFrame.

df.shape
Tuple of # of rows, # of columns in DataFrame.

df['w'].nunique()
of distinct values in a column.

df.describe()
Basic descriptive and statistics for each column (or GroupBy).

In [88]:
df['last'].nunique()#print how many values in specific columns

3

In [89]:
df.describe()

       first   last                        email
count      3      3                            3
unique     3      3                            3
top     mari  muthu  muthumariappan002@gmail.com
freq       1      1                            1

# HANDLING MISSING DATAS:

df.dropna()
Drop rows with any column having NA/null data.

df.fillna(value)
Replace all NA/null data with value.

# MAKE NEW CLOUMNS:

df.assign(Area=lambda df: df.Length*df.Height)
Compute and append one or more new columns.

df['Volume'] = df.Length*df.Height*df.Depth
Add single column.

pd.qcut(df.col, n, labels=False)
Bin column into n buckets.

# WINDOWS:

In [98]:
df.expanding()

Expanding [min_periods=1,axis=0,method=single]

In [101]:
df.rolling(4)#df.rolling(n)

Rolling [window=4,center=False,axis=0,method=single]